Tekla Open API Reference for Tekla Structures 2025
WpfShapeCatalog.ButtonWidth Property
 Gets and sets the width of the button control.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double ButtonWidth { get; set; }
Public Property ButtonWidth As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
WpfShapeCatalog Class
Tekla.Structures.Dialog.UIControls Namespace